Documents/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>УстановкаЦен</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныПродажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговЦен</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПорогЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена0</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог1</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПорогЦен</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог2</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПорогЦен</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог3</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПорогЦен</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешитьПродажу</Name>
							<Comment>(не используется)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПродажи</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена0</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог1</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПорогЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог2</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПорогЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог3</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПорогЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПродажу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УстановкаЦен/Ext/ObjectModule.bsl
// © Primus1C  12.04.2024  НАЧАЛО ►

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;
	
	омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщегоНазначенияСервер.ЗаполнитьРеквизитыДокументаПоУмолчанию(ЭтотОбъект);

	Склад = ПараметрыСеанса.Склад;
	
	Выборка = Справочники.ВидыЦен.Выбрать(Новый Структура("ПометкаУдаления", Ложь));
	Пока Выборка.следующий() Цикл
		НовСтрокаТЧ = ВидыЦен.Добавить();
		НовСтрокаТЧ.ВидЦены = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаЗаполнения(Отказ)
	
	Ошибки = Новый СписокЗначений;
	//ПроведениеДокументов.ПроверитьДубли(Товары, Ошибки, "Номенклатура");  // проверка на дубли производится в форме ПерезЗаписью()
	Для каждого Ош Из Ошибки Цикл
		Сообщить(Ош.Значение);
		Отказ = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверкаЗаполнения(Отказ);
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;

	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Ссылка", Ссылка);  
	
	Запр.Текст = "ВЫБРАТЬ
	             |	УстановкаЦенТовары.Ссылка.Дата КАК Период,
	             |	УстановкаЦенТовары.Номенклатура КАК Номенклатура,
	             |	УстановкаЦенТовары.ВидЦены КАК ВидЦены,
	             |	УстановкаЦенТовары.Цена0 КАК Цена0,
	             |	УстановкаЦенТовары.Цена1 КАК Цена1,
	             |	УстановкаЦенТовары.Порог1 КАК Порог1,
	             |	УстановкаЦенТовары.Цена2 КАК Цена2,
	             |	УстановкаЦенТовары.Порог2 КАК Порог2,
	             |	УстановкаЦенТовары.Цена3 КАК Цена3,
	             |	УстановкаЦенТовары.Порог3 КАК Порог3,
	             |	УстановкаЦенТовары.РазрешитьПродажу КАК РазрешитьПродажу,
	             |	УстановкаЦенТовары.Ссылка.Склад КАК Склад
	             |ИЗ
	             |	Документ.УстановкаЦен.Товары КАК УстановкаЦенТовары
	             |ГДЕ
	             |	УстановкаЦенТовары.Ссылка = &Ссылка";
	Выборка = Запр.Выполнить().Выбрать(); 
	
	Движения.ЦеныПродажи.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ЦеныПродажи.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		//Движение.Период = Дата;
	КонецЦикла;
	
	Движения.ЦеныПродажи.Записать();
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
